In [1]:
import pandas as pan

# Loading data

All the provided data was converted to CSV in the previous section. starting with the data sanity checks in the current version.

In [2]:
customers = pan.read_csv(r"C:\Users\bhara\Downloads\customer.csv")
orders = pan.read_csv(r"C:\Users\bhara\Downloads\order.csv")
shipping = pan.read_csv(r"C:\Users\bhara\Downloads\shipping_data.csv")

# Customer Data Sanity Checks

In [5]:
cust_data_length = len(customers)  # Counting the number of rows

cust_id_count = customers['Customer_ID'].nunique() # Counting the number of customers by checking the unique count of Customer Ids

Counting the null values if any

In [9]:
null_cust_id = customers['Customer_ID'].isna().sum()
null_first_name = customers['First'].isna().sum()
null_last_name = customers['Last'].isna().sum()
null_age = customers['Age'].isna().sum()
null_country = customers['Country'].isna().sum()

Counting the rows with invalid values eg: number of special chars in first name or last name and non numbric values in age and customer_id columns

In [13]:
invalid_age = ((customers['Age'] < 0) | (customers['Age'] > 120)).sum()
invalid_firstname = customers['First'].astype(str).str.contains(r'[^A-Za-z]', regex=True, na=False).sum()
invalid_lastname  = customers['Last'].astype(str).str.contains(r'[^A-Za-z]', regex=True, na=False).sum()
invalid_cust_id_all = ~customers['Customer_ID'].astype(str).str.match(r'^[0-9]+$', na=False)
invalid_cust_id = invalid_cust_id_all.sum()

In [23]:
sanity_check = pan.DataFrame({"Total_Rows" : [cust_data_length] , "Unique_Cust_Ids" : [cust_id_count] , "Null_cust_ids" : [null_cust_id],
                             "Null_first_name" : [null_first_name] , "Null_lastname" : [null_last_name] , "null_age" : [null_age] , 
                             "null_country" : [null_country], "invalid_age":[invalid_age] , "invalid_firstname" : [invalid_firstname],
                             "invalid_lastname" : [invalid_lastname] , "invalid_cust_id" : [invalid_cust_id]})

sanity_check

,Total_Rows,Unique_Cust_Ids,Null_cust_ids,Null_first_name,Null_lastname,null_age,null_country,invalid_age,invalid_firstname,invalid_lastname,invalid_cust_id
0,250,250,0,0,0,0,0,0,10,2,0

Checking the rown with name issues

In [19]:
issue_name_rows = customers[ customers['First'].astype(str).str.contains(r'[^A-Za-z]', regex=True, na=False) 
| customers['Last'].astype(str).str.contains(r'[^A-Za-z]', regex=True, na=False)]

issue_name_rows

     Customer_ID    First      Last  Age Country
5              6   N!cole     Jones   33     USA
13            14   N!cole      Lara   77      UK
108          109   R0bert     Moore   40      UK
112          113  Derrick   R0berts   72      UK
117          118   R0bert  Shepherd   28      UK
161          162   N!cole   Bennett   51     USA
170          171    L@rry      Cole   50     USA
197          198   R0bert     Bryan   49      UK
210          211   Al1cia  Thompson   38     USA
213          214   N!cole  Mcintyre   18      UK
235          236   Al1cia    Jensen   19     USA
241          242     Mark   R0berts   61     USA

we can see the issues in the above data is either first or last name is having a special character or number , below shows each row and the error is it

In [22]:
customers.loc[customers['First'].astype(str).str.contains(r'[0-9]', na=False), 'error_type'] = "first name has number"
customers.loc[customers['First'].astype(str).str.contains(r'[^A-Za-z0-9]', na=False), 'error_type'] = "first name has special char"
customers.loc[customers['Last'].astype(str).str.contains(r'[0-9]', na=False), 'error_type'] = "last name has number"
customers.loc[customers['Last'].astype(str).str.contains(r'[^A-Za-z0-9]', na=False), 'error_type'] = "last name has special char"

# showing only errors rows
errors = customers[customers['error_type'].notna()]

errors

     Customer_ID    First      Last  Age Country                   error_type
5              6   N!cole     Jones   33     USA  first name has special char
13            14   N!cole      Lara   77      UK  first name has special char
108          109   R0bert     Moore   40      UK        first name has number
112          113  Derrick   R0berts   72      UK         last name has number
117          118   R0bert  Shepherd   28      UK        first name has number
161          162   N!cole   Bennett   51     USA  first name has special char
170          171    L@rry      Cole   50     USA  first name has special char
197          198   R0bert     Bryan   49      UK        first name has number
210          211   Al1cia  Thompson   38     USA        first name has number
213          214   N!cole  Mcintyre   18      UK  first name has special char
235          236   Al1cia    Jensen   19     USA        first name has number
241          242     Mark   R0berts   61     USA         last name has number

# Orders data sanity check

In [28]:
order_data_length = len(orders)  # Counting the number of rows

order_id_count = orders['Order_ID'].nunique() # Counting the number of Order by checking the unique count of Order Ids
# counting for nulls 
null_order_id = orders['Order_ID'].isna().sum()
null_item = orders['Item'].isna().sum()
null_amount = orders['Amount'].isna().sum()
null_cust = orders['Customer_ID'].isna().sum()

# checking for numbers and junks in the Item columns

invalid_amount = ((orders['Amount'] < 0) ).sum()
invalid_item = orders['Item'].astype(str).str.contains(r'[^A-Za-z ]', regex=True, na=False).sum()
invalid_Order_ID_all = ~customers['Customer_ID'].astype(str).str.match(r'^[0-9]+$', na=False)
invalid_ordr_id = invalid_Order_ID_all.sum()
invalid_cust_id_all = ~customers['Customer_ID'].astype(str).str.match(r'^[0-9]+$', na=False)
invalid_cust_id = invalid_cust_id_all.sum()

order_sanity = pan.DataFrame({"Total_Rows" : [order_data_length] , "order_id_count" : [order_id_count] , "null_order_id" : [null_order_id],
                             "null_item" : [null_item] , "null_amount" : [null_amount] , "null_cust" : [null_cust] , 
                             "invalid_amount" : [invalid_amount], "invalid_item":[invalid_item] , "invalid_ordr_id" : [invalid_ordr_id],
                             "invalid_cust_id" : [invalid_cust_id]})

order_sanity

,Total_Rows,order_id_count,null_order_id,null_item,null_amount,null_cust,invalid_amount,invalid_item,invalid_ordr_id,invalid_cust_id
0,250,250,0,0,0,0,0,0,0,0

In [27]:
orders['Item'].unique()

array(['Keyboard', 'Mouse', 'Monitor', 'Mousepad', 'Harddisk', 'Webcam',
       'DDR RAM', 'Headset'], dtype=object)

# Shipping Data sanity checks

In [30]:
shipping_data_length = len(shipping)  # Counting the number of rows
shipping_id_count = shipping['Shipping_ID'].nunique() # Counting the number of shippings by checking the unique count of shipping Ids
# counting for nulls 
null_Shipping_ID = shipping['Shipping_ID'].isna().sum()
null_status = shipping['Status'].isna().sum()
null_cust = shipping['Customer_ID'].isna().sum()

# checking for numbers and junks in the Item columns

invalid_status = shipping['Status'].astype(str).str.contains(r'[^A-Za-z]', regex=True, na=False).sum()
invalid_Shipping_ID_all = ~shipping['Shipping_ID'].astype(str).str.match(r'^[0-9]+$', na=False)
invalid_Shipping_ID = invalid_Shipping_ID_all.sum()
invalid_cust_id_all = ~shipping['Customer_ID'].astype(str).str.match(r'^[0-9]+$', na=False)
invalid_cust_id = invalid_cust_id_all.sum()

shipping_sanity = pan.DataFrame({"shipping_data_length" : [shipping_data_length] , "shipping_id_count" : [shipping_id_count] ,
                                 "null_Shipping_ID" : [null_Shipping_ID],"null_status" : [null_status] , "null_cust" : [null_cust] ,
                                 "invalid_status" : [invalid_status] , "invalid_Shipping_ID" : [invalid_Shipping_ID],
                                 "invalid_cust_id":[invalid_cust_id]})

shipping_sanity

,shipping_data_length,shipping_id_count,null_Shipping_ID,null_status,null_cust,invalid_status,invalid_Shipping_ID,invalid_cust_id
0,250,250,0,0,0,0,0,0

# Context checking : checking if the customers in order table and shipping tables are from customer table only

In [31]:
customers = customers['Customer_ID'].unique()

not_customer_orders = orders[~orders['Customer_ID'].isin(customers)]
not_customer_shipping = shipping[~shipping['Customer_ID'].isin(customers)]

print(not_customer_orders)
print(not_customer_shipping)

Empty DataFrame
Columns: [Order_ID, Item, Amount, Customer_ID]
Index: []
Empty DataFrame
Columns: [Shipping_ID, Status, Customer_ID]
Index: []

Returned empty data frame which means all the orders were from listed customers and all to shipments were to listed customers only.